```
    [command]/home/cdot/actions-runner/_work/_temp/2cde139b-be10-4f26-84b0-eff4813fdf72/terraform-bin plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.san_vfw_01_auth_json.local_file.auth_json will be created
  + resource "local_file" "auth_json" {
      + content              = jsonencode(
            {
              + hostname = "10.60.0.21"
              + password = "paloalto1!"
              + username = "panofficehours"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./auth.json"
      + id                   = (known after apply)
    }

  # module.san_vfw_01_network.panos_ethernet_interface.this["ethernet1/1"] will be created
  + resource "panos_ethernet_interface" "this" {
      + create_dhcp_default_route = false
      + enable_dhcp               = false
      + id                        = (known after apply)
      + mode                      = "layer3"
      + name                      = "ethernet1/1"
      + static_ips                = [
          + "46.58.79.2/24",
        ]
      + vsys                      = "vsys1"
    }

  # module.san_vfw_01_network.panos_ethernet_interface.this["ethernet1/2"] will be created
  + resource "panos_ethernet_interface" "this" {
      + create_dhcp_default_route = false
      + enable_dhcp               = false
      + id                        = (known after apply)
      + mode                      = "layer3"
      + name                      = "ethernet1/2"
      + static_ips                = [
          + "192.168.31.1/24",
        ]
      + vsys                      = "vsys1"
    }

  # module.san_vfw_01_network.panos_ethernet_interface.this["ethernet1/3"] will be created
  + resource "panos_ethernet_interface" "this" {
      + create_dhcp_default_route = false
      + enable_dhcp               = false
      + id                        = (known after apply)
      + mode                      = "layer3"
      + name                      = "ethernet1/3"
      + static_ips                = [
          + "10.0.31.1/24",
        ]
      + vsys                      = "vsys1"
    }

  # module.san_vfw_01_network.panos_virtual_router.default_vr will be created
  + resource "panos_virtual_router" "default_vr" {
      + ebgp_dist        = 20
      + ibgp_dist        = 200
      + id               = (known after apply)
      + interfaces       = [
          + "ethernet1/1",
          + "ethernet1/2",
          + "ethernet1/3",
        ]
      + name             = "default"
      + ospf_ext_dist    = 110
      + ospf_int_dist    = 30
      + ospfv3_ext_dist  = 110
      + ospfv3_int_dist  = 30
      + rip_dist         = 120
      + static_dist      = 10
      + static_ipv6_dist = 10
    }

  # module.san_vfw_01_security_policies.panos_security_policy.policy["DMZ-to-WAN-allow"] will be created
  + resource "panos_security_policy" "policy" {
      + device_group = "shared"
      + id           = (known after apply)
      + rulebase     = "pre-rulebase"
      + vsys         = "vsys1"

      + rule {
          + action                = "allow"
          + applications          = [
              + "any",
            ]
          + categories            = [
              + "any",
            ]
          + destination_addresses = [
              + "any",
            ]
          + destination_zones     = [
              + "WAN",
            ]
          + log_end               = true
          + name                  = "DMZ-to-WAN-allow"
          + services              = [
              + "any",
            ]
          + source_addresses      = [
              + "any",
            ]
          + source_users          = [
              + "any",
            ]
          + source_zones          = [
              + "DMZ",
              + "LAN",
            ]
          + type                  = "universal"
          + uuid                  = (known after apply)
        }
    }

  # module.san_vfw_01_services.panos_service_object.service_tcp["service-tcp-221"] will be created
  + resource "panos_service_object" "service_tcp" {
      + description      = "Service object to map port 22 to 222"
      + destination_port = "221"
      + id               = (known after apply)
      + name             = "service-tcp-221"
      + protocol         = "tcp"
      + vsys             = "vsys1"
    }

  # module.san_vfw_01_services.panos_service_object.service_tcp["service-tcp-222"] will be created
  + resource "panos_service_object" "service_tcp" {
      + description      = "Service object to map port 22 to 222"
      + destination_port = "222"
      + id               = (known after apply)
      + name             = "service-tcp-222"
      + protocol         = "tcp"
      + vsys             = "vsys1"
    }

  # module.san_vfw_01_services.panos_service_object.service_tcp["service-tcp-81"] will be created
  + resource "panos_service_object" "service_tcp" {
      + description      = "Service object to map port 80 to 81"
      + destination_port = "81"
      + id               = (known after apply)
      + name             = "service-tcp-81"
      + protocol         = "tcp"
      + vsys             = "vsys1"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.san_vfw_01_auth_json.local_file.auth_json will be created%0A  + resource "local_file" "auth_json" {%0A      + content              = jsonencode(%0A            {%0A              + hostname = "10.60.0.21"%0A              + password = "paloalto1!"%0A              + username = "panofficehours"%0A            }%0A        )%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./auth.json"%0A      + id                   = (known after apply)%0A    }%0A%0A  # module.san_vfw_01_network.panos_ethernet_interface.this["ethernet1/1"] will be created%0A  + resource "panos_ethernet_interface" "this" {%0A      + create_dhcp_default_route = false%0A      + enable_dhcp               = false%0A      + id                        = (known after apply)%0A      + mode                      = "layer3"%0A      + name                      = "ethernet1/1"%0A      + static_ips                = [%0A          + "46.58.79.2/24",%0A        ]%0A      + vsys                      = "vsys1"%0A    }%0A%0A  # module.san_vfw_01_network.panos_ethernet_interface.this["ethernet1/2"] will be created%0A  + resource "panos_ethernet_interface" "this" {%0A      + create_dhcp_default_route = false%0A      + enable_dhcp               = false%0A      + id                        = (known after apply)%0A      + mode                      = "layer3"%0A      + name                      = "ethernet1/2"%0A      + static_ips                = [%0A          + "192.168.31.1/24",%0A        ]%0A      + vsys                      = "vsys1"%0A    }%0A%0A  # module.san_vfw_01_network.panos_ethernet_interface.this["ethernet1/3"] will be created%0A  + resource "panos_ethernet_interface" "this" {%0A      + create_dhcp_default_route = false%0A      + enable_dhcp               = false%0A      + id                        = (known after apply)%0A      + mode                      = "layer3"%0A      + name                      = "ethernet1/3"%0A      + static_ips                = [%0A          + "10.0.31.1/24",%0A        ]%0A      + vsys                      = "vsys1"%0A    }%0A%0A  # module.san_vfw_01_network.panos_virtual_router.default_vr will be created%0A  + resource "panos_virtual_router" "default_vr" {%0A      + ebgp_dist        = 20%0A      + ibgp_dist        = 200%0A      + id               = (known after apply)%0A      + interfaces       = [%0A          + "ethernet1/1",%0A          + "ethernet1/2",%0A          + "ethernet1/3",%0A        ]%0A      + name             = "default"%0A      + ospf_ext_dist    = 110%0A      + ospf_int_dist    = 30%0A      + ospfv3_ext_dist  = 110%0A      + ospfv3_int_dist  = 30%0A      + rip_dist         = 120%0A      + static_dist      = 10%0A      + static_ipv6_dist = 10%0A    }%0A%0A  # module.san_vfw_01_security_policies.panos_security_policy.policy["DMZ-to-WAN-allow"] will be created%0A  + resource "panos_security_policy" "policy" {%0A      + device_group = "shared"%0A      + id           = (known after apply)%0A      + rulebase     = "pre-rulebase"%0A      + vsys         = "vsys1"%0A%0A      + rule {%0A          + action                = "allow"%0A          + applications          = [%0A              + "any",%0A            ]%0A          + categories            = [%0A              + "any",%0A            ]%0A          + destination_addresses = [%0A              + "any",%0A            ]%0A          + destination_zones     = [%0A              + "WAN",%0A            ]%0A          + log_end               = true%0A          + name                  = "DMZ-to-WAN-allow"%0A          + services              = [%0A              + "any",%0A            ]%0A          + source_addresses      = [%0A              + "any",%0A            ]%0A          + source_users          = [%0A              + "any",%0A            ]%0A          + source_zones          = [%0A              + "DMZ",%0A              + "LAN",%0A            ]%0A          + type                  = "universal"%0A          + uuid                  = (known after apply)%0A        }%0A    }%0A%0A  # module.san_vfw_01_services.panos_service_object.service_tcp["service-tcp-221"] will be created%0A  + resource "panos_service_object" "service_tcp" {%0A      + description      = "Service object to map port 22 to 222"%0A      + destination_port = "221"%0A      + id               = (known after apply)%0A      + name             = "service-tcp-221"%0A      + protocol         = "tcp"%0A      + vsys             = "vsys1"%0A    }%0A%0A  # module.san_vfw_01_services.panos_service_object.service_tcp["service-tcp-222"] will be created%0A  + resource "panos_service_object" "service_tcp" {%0A      + description      = "Service object to map port 22 to 222"%0A      + destination_port = "222"%0A      + id               = (known after apply)%0A      + name             = "service-tcp-222"%0A      + protocol         = "tcp"%0A      + vsys             = "vsys1"%0A    }%0A%0A  # module.san_vfw_01_services.panos_service_object.service_tcp["service-tcp-81"] will be created%0A  + resource "panos_service_object" "service_tcp" {%0A      + description      = "Service object to map port 80 to 81"%0A      + destination_port = "81"%0A      + id               = (known after apply)%0A      + name             = "service-tcp-81"%0A      + protocol         = "tcp"%0A      + vsys             = "vsys1"%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

```